saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KMxx_DFP.1.3.0.pdsc
          <book name="Documents/rev2RC_KM3x256_RM.pdf" title="MKM34Z256xxx7 Device Reference Manual"/>
          <!-- book name="Documents/MKMxxZxxACxx5.pdf"   title="MKM34Z256xxx7 Device Data Sheet"/-->
        </device>
      </subFamily>

      </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="MKM13Z5 CMSIS">
      <description>NXP Kinetis KM13 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM13Z64xxx5"/>
    </condition>

    <condition id="MKM14Z5 CMSIS">
      <description>NXP Kinetis KM14 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM14Z64xxx5"/>
      <accept Dname="MKM14Z128xxx5"/>
    </condition>

    <condition id="MKM14ZA5 CMSIS">
      <description>NXP Kinetis KM14A 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM14Z64Axxx5"/>
      <accept Dname="MKM14Z128Axxx5"/>
    </condition>

    <condition id="MKM32Z5 CMSIS">
      <description>NXP Kinetis KM32 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM32Z64xxx5"/>
    </condition>

    <condition id="MKM33Z5 CMSIS">
      <description>NXP Kinetis KM33 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM33Z64xxx5"/>
      <accept Dname="MKM33Z128xxx5"/>
    </condition>

    <condition id="MKM33ZA5 CMSIS">
      <description>NXP Kinetis KM33A 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM33Z64Axxx5"/>
      <accept Dname="MKM33Z128Axxx5"/>
    </condition>

    <condition id="MKM34Z5 CMSIS">
      <description>NXP Kinetis KM33 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM34Z128xxx5"/>
    </condition>

    <condition id="MKM34ZA5 CMSIS">
      <description>NXP Kinetis KM34A 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM34Z128Axxx5"/>
    </condition>

    <condition id="MKM38Z5 CMSIS">
      <description>NXP Kinetis KM38 50MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM38Z128xxx5"/>
    </condition>

    <condition id="MKM34Z7 CMSIS">
      <description>NXP Kinetis KM34 75MHz Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11"/>
      <accept Dname="MKM34Z256xxx7"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup MKM13Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM13Z5 CMSIS">
      <description>System Startup for Kinetis KM13 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source" name="Device/Source/ARM/startup_MKM13Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device/Source/system_MKM13Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM14Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM14Z5 CMSIS">
      <description>System Startup for Kinetis KM14 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKM14Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKM14Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM14ZA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM14ZA5 CMSIS">
      <description>System Startup for Kinetis KM14A 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKM14ZA5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKM14ZA5.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKM14ZA5.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM32Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM32Z5 CMSIS">
      <description>System Startup for Kinetis KM32 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKM32Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKM32Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM33Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM33Z5 CMSIS">
      <description>System Startup for Kinetis KM33 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKM33Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKM33Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

