saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KMxx_DFP.1.3.0.pdsc
    <!-- Startup MKM33ZA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM33ZA5 CMSIS">
      <description>System Startup for Kinetis KM33A 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKM33ZA5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKM33ZA5.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKM33ZA5.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM34Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM34Z5 CMSIS">
      <description>System Startup for Kinetis KM34 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKM34Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKM34Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM34ZA5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM34ZA5 CMSIS">
      <description>System Startup for Kinetis KM34A 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKM34ZA5.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKM34ZA5.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKM34ZA5.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM38Z5 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM38Z5 CMSIS">
      <description>System Startup for Kinetis KM38 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKM38Z5.s"  attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKM38Z5.c"       attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup MKM34Z7 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKM34Z7 CMSIS">
      <description>System Startup for Kinetis KM34A 50MHz Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/ARM/startup_MKM34Z7.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/system_MKM34Z7.c"      attr="config" version="1.0.0"/>
        <file category="header"  name="Device/Source/system_MKM34Z7.h"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <bundle Cbundle="TWR-KM34Z50MV3" Cclass="Board Support" Cversion="1.0.0">
      <description>TWR-KM34Z50MV3 Board Support</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="MKM34ZA5 CMSIS">
        <description>A/D Converter interface for NXP TWR-KM34Z50MV3 board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KM34Z50MV3/Common/ADC_TWR-KM34Z50MV3.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="MKM34ZA5 CMSIS">
      <description>Button driver for NXP TWR-KM34Z50MV3 board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KM34Z50MV3/Common/Buttons_TWR-KM34Z50MV3.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="MKM34ZA5 CMSIS">
      <description>LED driver for NXP TWR-KM34Z50MV3 board</description>
        <files>
          <file category="source" name="Boards/NXP/TWR-KM34Z50MV3/Common/LED_TWR-KM34Z50MV3.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board name="TWR-KM34Z50" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKM34Z128xxx5"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KMxx Series" DsubFamily="KM3x"/>
      <description>TWR-KM34Z50M: Kinetis M Series Tower System Module.</description>
      <book category="overview"  name="http://www.nxp.com/products/microcontrollers-and-processors/arm-processors/kinetis-cortex-m-mcus/m-series-metrology-m0-plus/kinetis-m-series-tower-system-module:TWR-KM34Z50M"  title="TWR-KM34Z50M: Kinetis M Series Tower System Module"/>
      <book category="manual"    name="Boards/NXP/TWR-KM34Z50/Documents/TWRKM34Z50UM.pdf" title="TWR-KM34Z50 Tower Module User Manual"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="4"              name="Reset, Tamper, two user button"/>
      <feature type="LED"            n="4"              name="user-controllable LEDs"/>
      <feature type="Accelerometer"  n="1"              name="MMA8491Q Three-axis accelerometer"/>
      <feature type="Poti"           n="1"              name="Potentiometer"/>
      <feature type="ContOther"      n="1"              name="NTC temperature sensor"/>
      <feature type="IrDA"           n="1"              name="IrDA support"/>
    </board>
    
    <board name="TWR-KM34Z50MV3" vendor="NXP" revision="Rev. A2" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MKM34Z128Axxx5"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dfamily="KMxx Series" DsubFamily="KM3x"/>
      <description>TWR-KM34Z50MV3: Kinetis M Series Tower System Module.</description>
      <image small="Boards/NXP/TWR-KM34Z50MV3/Documents/TWR-KM34Z50MV3_small.jpg"/>
      <book category="overview"  name="http://www.nxp.com/products/microcontrollers-and-processors/arm-processors/kinetis-cortex-m-mcus/m-series-metrology-m0-plus/kinetis-m-series-tower-system-module:TWR-KM34Z50M"  title="TWR-KM34Z50M: Kinetis M Series Tower System Module"/>
      <book category="manual"    name="Boards/NXP/TWR-KM34Z50MV3/Documents/TWRKM34Z50UM.pdf" title="TWR-KM34Z50MV3 Tower Module User Manual"/>
      <feature type="ODbg"           n="1"              name="Integrated open-source JTAG via USB"/>
      <feature type="PWR"            n="5"              name="USB Powered"/>
      <feature type="Button"         n="4"              name="Reset, Tamper, two user button"/>
      <feature type="LED"            n="4"              name="user-controllable LEDs"/>
      <feature type="Accelerometer"  n="1"              name="MMA8491Q Three-axis accelerometer"/>
      <feature type="Poti"           n="1"              name="Potentiometer"/>
      <feature type="ContOther"      n="1"              name="NTC temperature sensor"/>
      <feature type="IrDA"           n="1"              name="IrDA support"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- TWR-KM34Z50 Tower Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KM34Z50/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KM34Z50" vendor="NXP" Dvendor="NXP:11" Dname="MKM34Z128xxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- TWR-KM34Z50MV3 Tower Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/TWR-KM34Z50MV3/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="TWR-KM34Z50MV3" vendor="NXP" Dvendor="NXP:11" Dname="MKM34Z128Axxx5"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
